			
Процедура Печать(ТабДок, Массив) Экспорт

	ЗапросОбучающиеся = Новый Запрос("ВЫБРАТЬ
	                                 |	Обучающиеся.Наименование КАК ФИО,
	                                 |	Обучающиеся.ДатаРождения КАК ДатаРождения,
	                                 |	Обучающиеся.Документ КАК Документ,
	                                 |	Обучающиеся.ДокументСерия КАК ДокументСерия,
	                                 |	Обучающиеся.ДокументНомер КАК ДокументНомер,
	                                 |	Обучающиеся.ДокументВыдан КАК ДокументВыдан,
	                                 |	Обучающиеся.СНИЛС КАК СНИЛС,
	                                 |	Обучающиеся.Адрес КАК Адрес,
	                                 |	РодителиТабл.Родитель.Наименование КАК РодительФИО,
	                                 |	РодителиТабл.Родитель.ДатаРождения КАК РодительДатаРождения,
	                                 |	РодителиТабл.Родитель.ДокументСерия КАК РодительДокументСерия,
	                                 |	РодителиТабл.Родитель.ДокументНомер КАК РодительДокументНомер,
	                                 |	РодителиТабл.Родитель.ДокументВыдан КАК РодительДокументВыдан,
	                                 |	РодителиТабл.Родитель.ДокументДатаВыдачи КАК РодительДокументДатаВыдачи,
	                                 |	РодителиТабл.Родитель.СНИЛС КАК РодительСНИЛС,
	                                 |	РодителиТабл.Родитель.КонтактныйТелефон КАК РодительКонтактныйТелефон,
	                                 |	Обучающиеся.ДатаВыдачиДокумента КАК ДатаВыдачиДокумента,
	                                 |	РодителиТабл.Родитель.Ссылка КАК РодительСсылка
	                                 |ИЗ
	                                 |	Справочник.Обучающиеся.Родители КАК РодителиТабл
	                                 |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Обучающиеся КАК Обучающиеся
	                                 |		ПО РодителиТабл.Ссылка = Обучающиеся.Ссылка
	                                 |ГДЕ
	                                 |	Обучающиеся.Ссылка В(&Массив)");
	ЗапросОбучающиеся.УстановитьПараметр("Массив",Массив);
	Обучающийся = ЗапросОбучающиеся.Выполнить().Выбрать();
	
	Макет = ПолучитьОбщийМакет("УведомлениеПДн");
	Область = Макет.ПолучитьОбласть("Область");
	
	
	Пока Обучающийся.Следующий() Цикл
		Область.Параметры.ФИООбучающегося = Обучающийся.ФИО;
		Область.Параметры.ДатаРожденияОбучающегося = Формат(Обучающийся.ДатаРождения, "ДФ=dd.MM.yyyy");
		Область.Параметры.ТипДокументаОбучающегося = Обучающийся.Документ;
		Область.Параметры.ДокСерияОбучающегося = Обучающийся.ДокументСерия;
		Область.Параметры.ДокНомерОбучающегося = Обучающийся.ДокументНомер;
		Область.Параметры.ДокВыданОбучающегося = Обучающийся.ДокументВыдан;
		Область.Параметры.ДокДатаВыдачиОбучающиегося = Формат(Обучающийся.ДатаВыдачиДокумента, "ДФ=dd.MM.yyyy");
		Область.Параметры.СНИЛСОбучающегося = Обучающийся.СНИЛС;
		Область.Параметры.АдресОбучающегося = Обучающийся.Адрес;
		Область.Параметры.ФИОРодителя = Обучающийся.РодительФИО;
		Область.Параметры.ДатаРожденияРодителя = Формат(Обучающийся.РодительДатаРождения, "ДФ=dd.MM.yyyy");
		Область.Параметры.ТипДокументаРодителя = Перечисления.Документы.ПаспортГражданинаРФ;
		Область.Параметры.ДокСерияРодителя = Обучающийся.РодительДокументСерия;
		Область.Параметры.ДокНомерРодителя = Обучающийся.РодительДокументНомер;
		Область.Параметры.ДокВыданРодителя = Обучающийся.РодительДокументВыдан;
		Область.Параметры.ДокДатаВыдачиРодителя = Формат(Обучающийся.РодительДокументДатаВыдачи, "ДФ=dd.MM.yyyy");
		Область.Параметры.СНИЛСРодителя = Обучающийся.РодительСНИЛС;
		Область.Параметры.ТелефонРодителя = Формат(Обучающийся.РодительКонтактныйТелефон,"ЧГ=0");
		Область.Параметры.ФИОРодителяКратко = ПолучитьИнициалы(Обучающийся.РодительСсылка);
		                                          
		
		ТабДок.Вывести(Область);
		ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
	 КонецЦикла; 
КонецПроцедуры