 

&НаСервере
Процедура ВыводМесяц(Флаг)
	Если Объект.МесяцВыплаты = '00010101' Тогда
		 Объект.МесяцВыплаты = НачалоМесяца(ДобавитьМесяц(Объект.Дата,1));
		 Объект.УчебныйГод = ПолучитьУчебныйГод(Объект.МесяцВыплаты);
	КонецЕсли;
	 
	МесяцСтрока = МесяцВСтроку(Месяц(Объект.МесяцВыплаты));
	
	Если Флаг Тогда
		Объект.УчебныйГод = ПолучитьУчебныйГод(Объект.МесяцВыплаты);	
	КонецЕсли;
	Если Объект.Обучающиеся.Количество() > 0 И Флаг Тогда
		Объект.Обучающиеся.Очистить();
		
	КонецЕсли;
	
КонецПроцедуры
 
&НаКлиенте
Процедура ПриОткрытии(Отказ) 
	ВыводМесяц(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОбучающихся(Команда)
	ЗаполнитьОбучающихсяНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Если Объект.Обучающиеся.Количество() > 0 Тогда
		Объект.Обучающиеся.Очистить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура МесяцВыплатыПриИзменении(Элемент)
	ВыводМесяц(Истина);	
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьОбучающихсяНаСервере() 
	Объект.Обучающиеся.Очистить();
	
	         // Null сумма выплаты
	ЗапросОбучающиеся = Новый Запрос("ВЫБРАТЬ
	                                 |	Движения.Обучающийся КАК Обучающийся,
	                                 |	Движения.Обучающийся.ДатаРождения КАК ДатаРождения,
	                                 |	Движения.Класс КАК Класс,
	                                 |	БанковскиеРеквизиты.Банк КАК Банк,
	                                 |	БанковскиеРеквизиты.РасчетныйСчет КАК РасчетныйСчет,
	                                 |	БанковскиеРеквизиты.ВладелецСчета КАК Родитель,
	                                 |	БанковскиеРеквизиты.ВладелецСчета.ДатаРождения КАК РодительДатаРождения,
	                                 |	Льготы.Категория КАК Категория,
	                                 |	Льготы.ДатаПриказа КАК ДатаПриказа,
	                                 |	ЕСТЬNULL(Выплаты.СуммаПриход, 0) КАК ВыплаченоСумма,
	                                 |	3000 КАК Сумма,
	                                 |	УдостоверенияМногодетных.НомерУдостоверения КАК НомерУдостоверения,
	                                 |	УдостоверенияМногодетных.СрокДействия КАК СрокДействия
	                                 |ИЗ
	                                 |	РегистрСведений.ДвиженияОбучающихся.СрезПоследних(&Дата, Отчислен = ЛОЖЬ) КАК Движения
	                                 |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Обучающиеся.Льготы КАК Льготы
	                                 |		ПО Движения.Обучающийся = Льготы.Ссылка
	                                 |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Обучающиеся.БанковскиеРеквизиты КАК БанковскиеРеквизиты
	                                 |		ПО Движения.Обучающийся = БанковскиеРеквизиты.Ссылка
	                                 |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВыплатыЛьготникам.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, День, , ТипВыплаты = &ТипВыплаты) КАК Выплаты
	                                 |		ПО Движения.Обучающийся = Выплаты.Обучающийся
	                                 |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Обучающиеся.УдостоверениеМногодетных КАК УдостоверенияМногодетных
	                                 |		ПО Движения.Обучающийся = УдостоверенияМногодетных.Ссылка
	                                 |ГДЕ
	                                 |	ЕСТЬNULL(Выплаты.СуммаПриход, 0) = 0 
									 |  И БанковскиеРеквизиты.Актуальный = Истина
									 |  И Льготы.Заявитель = БанковскиеРеквизиты.ВладелецСчета
									 |  И УдостоверенияМногодетных.Актуальное = Истина
	                                 |	И Льготы.НаименованиеЛьготы = &ТипВыплаты
	                                 |	И Льготы.Начало МЕЖДУ &НачалоПериода И &КонецПериода
	                                 |	И Движения.Обучающийся.ДатаРождения = БанковскиеРеквизиты.Ссылка.ДатаРождения
	                                 |	И Движения.Обучающийся.ДатаРождения = УдостоверенияМногодетных.Ссылка.ДатаРождения"); 
	
	ЗапросОбучающиеся.УстановитьПараметр("Дата",Объект.Дата);
	ЗапросОбучающиеся.УстановитьПараметр("НачалоПериода",Объект.УчебныйГод.Начало);
	ЗапросОбучающиеся.УстановитьПараметр("КонецПериода",Объект.УчебныйГод.Окончание);
	ЗапросОбучающиеся.УстановитьПараметр("ТипВыплаты",Перечисления.ПереченьЛьгот.КомпенсацияЗаОдежду);
	
	Выборка = ЗапросОбучающиеся.Выполнить().Выбрать(); //Все данные по ученикам
		
	Пока Выборка.Следующий() Цикл
		Строка = Объект.Обучающиеся.Добавить();
		Строка.Обучающийся = Выборка.Обучающийся;
		Строка.Класс = Выборка.Класс;
		Строка.Банк = Выборка.Банк;
		Строка.Сумма = Выборка.Сумма;
		Строка.РасчетныйСчет = Выборка.РасчетныйСчет;
		Строка.Родитель = Выборка.Родитель;
		Строка.УдостоверениеМногодетныхНомер = Выборка.НомерУдостоверения;
		Строка.СрокДействия = Выборка.СрокДействия;
	КонецЦикла;
	
	
КонецПроцедуры