Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПФР_Налоговая_СоцВыплаты.Номер КАК Номер,
	|	ПФР_Налоговая_СоцВыплаты.Дата КАК Дата,
	|	ПФР_Налоговая_СоцВыплаты.Обучающийся КАК Обучающийся,
	|	ПФР_Налоговая_СоцВыплаты.Класс КАК Класс,
	|	ПФР_Налоговая_СоцВыплаты.ПриказОЗачислении КАК ПриказОЗачислении,
	|	ПФР_Налоговая_СоцВыплаты.ДатаОкончанияОбучения КАК ДатаОкончанияОбучения,
	|	ПФР_Налоговая_СоцВыплаты.КлассныйРуководитель КАК КлассныйРуководитель
	|ИЗ
	|	Документ.ПФР_Налоговая_СоцВыплаты КАК ПФР_Налоговая_СоцВыплаты
	|ГДЕ
	|	ПФР_Налоговая_СоцВыплаты.Ссылка В(&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	ЗапросКонстанта = Новый Запрос("Выбрать Константы.РуководительОрганизации Как Объект Из Константы");
	Руководитель = ЗапросКонстанта.Выполнить().Выбрать();
	Если Не Руководитель.Следующий() Тогда
		Сообщить("Ошибка: Не удалось получить данные о руководителе организации");
		Возврат;
    КонецЕсли;
	
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ВыводСправкаПФР_Налоговая_СоцВыплаты(Выборка,ТабДок,Руководитель.Объект);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры 





