&НаСервере
Функция ПолучитьАктуальныйКласс(Ссылка)
	Отбор = Новый Структура("Обучающийся", Ссылка);
	Срез = РегистрыСведений.ДвиженияОбучающихся.СрезПоследних(Объект.Дата,Отбор);
	Если Срез.Количество() < 1 Тогда  // Если не найдено данных
		Отчислен = Ложь;
		Возврат Ложь;
	Иначе
		 Объект.Класс = Срез[0].Класс;  
		 ЗапросУчебныйГод = Новый Запрос("ВЫБРАТЬ
		                                 |	УчебныеГодаКлассноеРуководство.Класс КАК Класс
		                                 |ИЗ
		                                 |	Справочник.УчебныеГода.КлассноеРуководство КАК УчебныеГодаКлассноеРуководство
		                                 |ГДЕ
		                                 |	УчебныеГодаКлассноеРуководство.Класс = &Класс");
		 ЗапросУчебныйГод.УстановитьПараметр("Класс",Объект.Класс);
		 Выборка = ЗапросУчебныйГод.Выполнить().Выбрать();
		 Возврат Истина;
	КонецЕсли
КонецФункции

&НаКлиенте
Процедура ОбучающийсяПриИзменении(Элемент)
	Ответ = ПолучитьАктуальныйКласс(Объект.Обучающийся);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Ответ = ПолучитьАктуальныйКласс(Объект.Обучающийся);
КонецПроцедуры
