
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ЖурналЗаполненияЕГИССО
	Движения.ЖурналЗаполненияЕГИССО.Записывать = Истина;
	Для Каждого ТекСтрокаТаблица Из Таблица Цикл
		Движение = Движения.ЖурналЗаполненияЕГИССО.Добавить();
		Движение.Период = Дата;
		Движение.ТипЕГИССО = ТипЕГИССО;
		Движение.УчебныйГод = УчебныйГод;
		Движение.Обучающийся = ТекСтрокаТаблица.Обучающийся;
		Движение.Родитель = ТекСтрокаТаблица.Родитель;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
