
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ВыплатыЛьготникам Приход
	Движения.ВыплатыЛьготникам.Записывать = Истина;
	Для Каждого ТекСтрокаОбучающиеся Из Обучающиеся Цикл
		Движение = Движения.ВыплатыЛьготникам.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = МесяцВыплаты;
		Движение.Обучающийся = ТекСтрокаОбучающиеся.Обучающийся;
		Движение.Родитель = ТекСтрокаОбучающиеся.Родитель;
		Движение.ТипВыплаты = Перечисления.ПереченьЛьгот.КомпенсацияЗаОдежду;
		Движение.УчебныйГод = УчебныйГод;
		Движение.Сумма = ТекСтрокаОбучающиеся.Сумма;
		Движение.РасчетныйСчет = ТекСтрокаОбучающиеся.РасчетныйСчет;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
