
&НаКлиенте
Процедура УбавитьГод(Команда)
	Год = Год - 1;
	УстановитьОтборПоГоду();
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьГод(Команда)
	Год = Год + 1;
	УстановитьОтборПоГоду();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Год = Год(ТекущаяДата()); 
	УстановитьОтборПоГоду();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПоГоду()
	Список.Параметры.УстановитьЗначениеПараметра("Год",Год);	
КонецПроцедуры

&НаКлиенте
Процедура ГодПриИзменении(Элемент)
	Сообщить(Год);
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	ТабДок = Новый ТабличныйДокумент;
	ПечатьНаСервере(ТабДок);

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Истина;
	ТабДок.ТолькоПросмотр = Истина;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать();
	
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаСервере
Процедура ПечатьНаСервере(ТабДок)
	
	ТабДок.Очистить();
	ТабДок.ТолькоПросмотр = Истина;
	
	Макет = ПолучитьМакетНаСервере("Макет");
	

	ОбластьШапка = Макет.ПолучитьОбласть("ОбластьШапка");
	ОбластьТаблДанные = Макет.ПолучитьОбласть("ОбластьТаблДанные");
	                                                  
	ОбластьШапка.Параметры.Год = Формат(Год, "ЧГ=0");
	ТабДок.Вывести(ОбластьШапка);
	
	СправкиЗапрос = Новый Запрос("ВЫБРАТЬ
	                             |	ЖурналДокументовЖурналВыдачиСправок.Ссылка КАК Ссылка,
	                             |	ЖурналДокументовЖурналВыдачиСправок.Дата КАК Дата,
	                             |	ЖурналДокументовЖурналВыдачиСправок.Номер КАК Номер,
	                             |	ЖурналДокументовЖурналВыдачиСправок.Обучающийся КАК Обучающийся,
	                             |	ЖурналДокументовЖурналВыдачиСправок.Тип КАК Тип
	                             |ИЗ
	                             |	ЖурналДокументов.ЖурналВыдачиСправок КАК ЖурналДокументовЖурналВыдачиСправок
	                             |ГДЕ
	                             |	ГОД(ЖурналДокументовЖурналВыдачиСправок.Дата) = &Год
	                             |
	                             |УПОРЯДОЧИТЬ ПО
	                             |	Номер,
	                             |	Обучающийся");
	СправкиЗапрос.Параметры.Вставить("Год",Год);
	Справка = СправкиЗапрос.Выполнить().Выбрать();
	
	Пока Справка.Следующий() Цикл
		ОбластьТаблДанные.Параметры.Номер = Справка.Номер;
		ОбластьТаблДанные.Параметры.Дата = Формат(Справка.Дата, "ДФ=dd.MM.yyyy");
		ОбластьТаблДанные.Параметры.ТипДокумента = Справка.Тип;
		ОбластьТаблДанные.Параметры.ФИО = Справка.Обучающийся.Наименование;
		ТабДок.Вывести(ОбластьТаблДанные);	
	КонецЦикла;
	
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.МасштабПечати = 100;
	
	ТабДок.РазмерСтраницы = "A4";
	ТабДок.ТочностьПечати = ТочностьПечати.Точная;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьМакетНаСервере(ИмяМакета)
		
	Макет = ЖурналыДокументов.ЖурналВыдачиСправок.ПолучитьМакет(ИмяМакета);
	Возврат Макет;
	
КонецФункции