&НаСервере
Процедура ЗаполнитьКлассыНаСервере()
Запрос = Новый Запрос;
Запрос.Текст = "ВЫБРАТЬ
	|	Классы.Ссылка КАК Класс
	|ИЗ
	|	Справочник.Классы КАК Классы
	|ГДЕ
	|	НЕ Классы.ПометкаУдаления
	|УПОРЯДОЧИТЬ ПО
	|	Классы.Наименование";

Выборка = Запрос.Выполнить().Выбрать();
Пока Выборка.Следующий() Цикл
	НоваяСтрока = Объект.КлассноеРуководство.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока,Выборка);
КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКлассы(Команда)
    ЗаполнитьКлассыНаСервере();
КонецПроцедуры




