&НаСервере
Процедура ПоискДублейНаСервере()
Запрос = Новый Запрос;
Запрос.Текст = "ВЫБРАТЬ
	|	Родители.Ссылка КАК Родители
	|ИЗ
	|	Справочник.Родители КАК Родители
	|ГДЕ
	|	НЕ Родители.ПометкаУдаления
	|СГРУППИРОВАТЬ ПО
	|	Родители.Наименование";

Запрос2 = Новый Запрос;
Запрос2.Текст = "ВЫБРАТЬ
	|	Родители.Наименование КАК Наименование
	|	Родители.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Родители КАК Родители
	|ГДЕ
	|	НЕ Родители.ПометкаУдаления
	| 	Родители.Наименование В
	|		(ВЫБРАТЬ
	|			Дубли.Наименование КАК Наименование
	|		ИЗ
	|			Дубли как Дубли)
	|ИТОГИ ПО
	|	Родители.Наименование";
КонецПроцедуры

&НаКлиенте
Процедура ПоискДублей(Команда)
	ПоискДублейНаСервере();
КонецПроцедуры
