
&НаКлиенте
Процедура ЭкспортXLS(Команда)
	Имя = ИмяФайла + ".xlsx";
    Директория = Директория + "/";
    ПолныйПутьКФайлу = Директория + Имя; 
    Попытка
	    ТабличныйДокумент.Записать(ПолныйПутьКФайлу,ТипФайлаТабличногоДокумента.XLSX);
	    Сообщить("Записан новый файл " + ПолныйПутьКФайлу);
    	ЗапуститьПриложение(ПолныйПутьКФайлу);
    Исключение
   
    Сообщить(ОписаниеОшибки());    

    КонецПопытки; 
КонецПроцедуры

&НаКлиенте
Процедура ДиректорияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Проводник = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Проводник.Заголовок="Выберите папку";
	Оповещение=Новый ОписаниеОповещения("ПослеВыбораФайла",ЭтотОбъект);
	Проводник.Показать(Оповещение);
КонецПроцедуры


&НаКлиенте
Процедура ПослеВыбораФайла(ВыбранныеДиректории,ДополнительныеПараметры) Экспорт
	Если ВыбранныеДиректории=Неопределено Тогда
		Возврат;
	КонецЕсли;
	Директория=ВыбранныеДиректории[0];
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ Параметры.Свойство("Таблица") Тогда
		Возврат;
	КонецЕсли;
	Если НЕ Параметры.Свойство("Имя") Тогда
		Возврат;
	КонецЕсли;
	ИмяФайла = Параметры.Имя;
	ТабличныйДокумент = Параметры.Таблица;
КонецПроцедуры
