
&НаКлиенте
Процедура КомандаСформироватьОтчет(Команда)
	Отчет();
КонецПроцедуры

&НаСервере
Процедура Отчет()
	
	ТабДок = ТабличныйДокумент;
	ТабДок.Очистить();
	ТабДок.ТолькоПросмотр = Истина;
	
	Макет = ПолучитьМакетНаСервере("СписокКласса");
		
	ЗапросДанных = Новый Запрос;
	ЗапросДанных.Текст = "ВЫБРАТЬ
	                     |	Движения.Обучающийся КАК О,
						 |	Движения.Обучающийся.Наименование КАК Имя,
	                     |	Движения.Обучающийся.Родители.(
	                     |		Родитель КАК Родитель,
	                     |		Родитель.КонтактныйТелефон КАК Телефон,
	                     |		Тип КАК Тип
	                     |	) КАК Родители,
	                     |	УчебныеГодаКлассноеРуководство.КлассныйРуководитель КАК КлассныйРуководитель
	                     |ИЗ
	                     |	РегистрСведений.ДвиженияОбучающихся.СрезПоследних(&НачалоПериода, ) КАК Движения
	                     |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УчебныеГода.КлассноеРуководство КАК УчебныеГодаКлассноеРуководство
	                     |		ПО Движения.УчебныйГод = УчебныеГодаКлассноеРуководство.Ссылка
	                     |			И Движения.Класс = УчебныеГодаКлассноеРуководство.Класс
	                     |ГДЕ
	                     |	Движения.Отчислен = ЛОЖЬ
	                     |	И Движения.Класс = &Класс
	                     |	И Движения.УчебныйГод = &УчебныйГод
	                     |
	                     |УПОРЯДОЧИТЬ ПО
	                     |	Имя";
	ЗапросДанных.Параметры.Вставить("НачалоПериода",Дата);
	ЗапросДанных.Параметры.Вставить("Класс",Класс);
	ЗапросДанных.Параметры.Вставить("УчебныйГод",УчебныйГод);
	
	Обучающийся = ЗапросДанных.Выполнить().Выбрать();

	ОбластьШапка = Макет.ПолучитьОбласть("ОбластьШапка");
	ОбластьТаблДанные = Макет.ПолучитьОбласть("ОбластьТаблДанные");
	ОбластьПодвал = Макет.ПолучитьОбласть("ОбластьПодвал");
	
	ОбластьШапка.Параметры.Класс = Класс.Наименование;
	ОбластьШапка.Параметры.Дата = Формат(Дата, "ДФ=dd.MM.yyyy");
	ТабДок.Вывести(ОбластьШапка);
	
	Счетчик = 1;
	КолМальчиков = 0;
	КолДевочек = 0;
	
	
	Пока Обучающийся.Следующий() Цикл
		ОбластьТаблДанные.Параметры.Номер = Счетчик;
		ОбластьТаблДанные.Параметры.ЛичноеДело = Обучающийся.О.ЛичноеДело;
		ОбластьТаблДанные.Параметры.ФИО = Обучающийся.О.Наименование;
		ОбластьТаблДанные.Параметры.ДатаРождения = Формат(Обучающийся.О.ДатаРождения, "ДФ=dd.MM.yyyy");
		ОбластьТаблДанные.Параметры.Адрес = Обучающийся.О.Адрес;
		ОбластьТаблДанные.Параметры.Телефон = "";
		Счетчик = Счетчик + 1;
		
		Если Обучающийся.О.Пол = Перечисления.Пол.Мужской Тогда
			КолМальчиков = КолМальчиков + 1;	
		ИначеЕсли Обучающийся.О.Пол = Перечисления.Пол.Женский Тогда 
			КолДевочек = КолДевочек + 1; 			
		КонецЕсли;	
		
		Родители = Обучающийся.Родители.Выбрать();
		Мать = Справочники.Родители.ПустаяСсылка();
		Отец = Справочники.Родители.ПустаяСсылка();
		ЗаконныйПредставитель = Справочники.Родители.ПустаяСсылка();
		Пока Родители.Следующий() Цикл
			Если Родители.Тип =	Перечисления.Родители.Мать Тогда
				Мать = Родители.Родитель;
			ИначеЕсли Родители.Тип = Перечисления.Родители.Отец Тогда 
			   	Отец = Родители.Родитель;
			ИначеЕсли Родители.Тип = Перечисления.Родители.ЗаконныйПредставитель Тогда 
			   	ЗаконныйПредставитель = Родители.Родитель;	  
			КонецЕсли;
		КонецЦикла;
		
		Если Мать <> Справочники.Родители.ПустаяСсылка() Тогда
			ОбластьТаблДанные.Параметры.Телефон = Формат(Мать.КонтактныйТелефон,"ЧГ=0");
		ИначеЕсли Отец <> Справочники.Родители.ПустаяСсылка() Тогда 
		   	ОбластьТаблДанные.Параметры.Телефон = Формат(Отец.КонтактныйТелефон,"ЧГ=0");
		ИначеЕсли ЗаконныйПредставитель <> Справочники.Родители.ПустаяСсылка() Тогда 
			ОбластьТаблДанные.Параметры.Телефон = Формат(ЗаконныйПредставитель.КонтактныйТелефон,"ЧГ=0");	  
		КонецЕсли;
		
		ТабДок.Вывести(ОбластьТаблДанные);
	КонецЦикла;
	
	ЗапросУчебныйГод = Новый Запрос("ВЫБРАТЬ
		                                 |	УчебныеГодаКлассноеРуководство.Класс КАК Класс,
		                                 |	УчебныеГодаКлассноеРуководство.КлассныйРуководитель КАК КлассныйРуководитель
		                                 |ИЗ
		                                 |	Справочник.УчебныеГода.КлассноеРуководство КАК УчебныеГодаКлассноеРуководство
		                                 |ГДЕ
		                                 |	УчебныеГодаКлассноеРуководство.Класс = &Класс
		                                 |	И УчебныеГодаКлассноеРуководство.Ссылка = &УчебныйГод");
	ЗапросУчебныйГод.УстановитьПараметр("Класс",Класс);
	ЗапросУчебныйГод.УстановитьПараметр("УчебныйГод",УчебныйГод);
	Выборка = ЗапросУчебныйГод.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ОбластьПодвал.Параметры.КлассныйРуководитель = Выборка.КлассныйРуководитель;	 
	Иначе
		ОбластьПодвал.Параметры.КлассныйРуководитель = Справочники.Сотрудники.ПустаяСсылка();
	КонецЕсли;
	
	ОбластьПодвал.Параметры.КолМальчиков = КолМальчиков;
	ОбластьПодвал.Параметры.КолДевочек = КолДевочек;
	ТабДок.Вывести(ОбластьПодвал);
	
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.МасштабПечати = 100;
	
	ТабДок.РазмерСтраницы = "A4";
	ТабДок.ТочностьПечати = ТочностьПечати.Точная;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьМакетНаСервере(ИмяМакета)
	
	ЭО = РеквизитФормыВЗначение("Отчет");
	Макет = ЭО.ПолучитьМакет(ИмяМакета);
	Возврат Макет;
	
КонецФункции
