 

&НаСервере
Процедура ВыводМесяц(Флаг)
	Если Объект.МесяцВыплаты = '00010101' Тогда
		 Объект.МесяцВыплаты = НачалоМесяца(ДобавитьМесяц(Объект.Дата,1)); 
		 Объект.УчебныйГод = ПолучитьУчебныйГод(Объект.МесяцВыплаты);
	КонецЕсли;
	 
	МесяцСтрока = МесяцВСтроку(Месяц(Объект.МесяцВыплаты));
	
	Если Флаг Тогда
		Объект.УчебныйГод = ПолучитьУчебныйГод(Объект.МесяцВыплаты);	
	КонецЕсли;
	Если Объект.Обучающиеся.Количество() > 0 И Флаг Тогда
		Объект.Обучающиеся.Очистить();
		
	КонецЕсли;
	
КонецПроцедуры
 
&НаКлиенте
Процедура МесяцМинус(Команда)    
	Если Объект.МесяцВыплаты <= 1 Тогда
		Объект.МесяцВыплаты = 12;
	ИначеЕсли Объект.МесяцВыплаты > 12 Тогда
		Объект.МесяцВыплаты = 12;
	Иначе
		Объект.МесяцВыплаты = Объект.МесяцВыплаты - 1;
	КонецЕсли; 
	
	ВыводМесяц(Истина);	
КонецПроцедуры

&НаКлиенте
Процедура МесяцПлюс(Команда)
	Если Объект.МесяцВыплаты >= 12 Тогда
		Объект.МесяцВыплаты = 1;
	ИначеЕсли Объект.МесяцВыплаты < 1 Тогда
		Объект.МесяцВыплаты = 1;
	Иначе
		Объект.МесяцВыплаты = Объект.МесяцВыплаты + 1;
	КонецЕсли;
	
	ВыводМесяц(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ) 
	ВыводМесяц(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОбучающихся(Команда)
	ЗаполнитьОбучающихсяНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОбучающихсяНаСервере() 
	Объект.Обучающиеся.Очистить();
	
	
	ЗапросОбучающиеся = Новый Запрос("ВЫБРАТЬ
	                                 |	Движения.Обучающийся КАК Обучающийся,
									 |	Движения.Обучающийся.ДатаРождения КАК ДатаРождения,
	                                 |	Движения.Класс КАК Класс,
	                                 |	Банки.Банк КАК Банк,
	                                 |	Банки.РасчетныйСчет КАК РасчетныйСчет,
	                                 |	УдостоверенияМногодетных.Выдан КАК Родитель,
	                                 |	УдостоверенияМногодетных.НомерУдостоверения КАК НомерУдостоверения,
	                                 |	УдостоверенияМногодетных.СрокДействия КАК СрокДействия
	                                 |ИЗ
	                                 |	РегистрСведений.ДвиженияОбучающихся.СрезПоследних(&Дата, Отчислен = ЛОЖЬ) КАК Движения
	                                 |	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Обучающиеся.Льготы КАК Льготы
	                                 |	ПО Движения.Обучающийся = Льготы.Ссылка
	                                 |	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Обучающиеся.УдостоверениеМногодетных КАК УдостоверенияМногодетных
	                                 |	ПО Движения.Обучающийся = УдостоверенияМногодетных.Ссылка
									 |	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Обучающиеся.БанковскиеРеквизиты КАК Банки
	                                 |	ПО УдостоверенияМногодетных.Выдан = Банки.ВладелецСчета
	                                 |ГДЕ
	                                 |	Льготы.НаименованиеЛьготы = &НаименованиеЛьготы
									 |  И Банки.Актуальный = Истина
									 |  И Льготы.Заявитель = Банки.ВладелецСчета
									 |  И УдостоверенияМногодетных.Актуальное = Истина
	                                 |	И Льготы.Начало <= &ДатаВыплаты
	                                 |	И Льготы.Окончание >= &ДатаВыплаты
	                                 |	И УдостоверенияМногодетных.СрокДействия >= &ДатаВыплаты
									 |  И Движения.Обучающийся.ДатаРождения = УдостоверенияМногодетных.Ссылка.ДатаРождения
									 |	И Движения.Обучающийся.ДатаРождения = Банки.Ссылка.ДатаРождения");
	ЗапросОбучающиеся.УстановитьПараметр("Дата",Объект.Дата);
	ЗапросОбучающиеся.УстановитьПараметр("ДатаВыплаты",Объект.МесяцВыплаты);
	ЗапросОбучающиеся.УстановитьПараметр("НаименованиеЛьготы",Перечисления.ПереченьЛьгот.КомпенсацияЗаПроезд);
	
	Выборка = ЗапросОбучающиеся.Выполнить().Выбрать(); //Все данные по ученикам
	
	Пока Выборка.Следующий() Цикл
		Строка = Объект.Обучающиеся.Добавить();
		Строка.Обучающийся = Выборка.Обучающийся;
		Строка.Класс = Выборка.Класс;
		Строка.Банк = Выборка.Банк;
		Строка.РасчетныйСчет = Выборка.РасчетныйСчет;
		Строка.Родитель = Выборка.Родитель;
		Строка.УдостоверениеМногодетныхНомер = Выборка.НомерУдостоверения;
		Строка.СрокДействия = Выборка.СрокДействия;
	КонецЦикла;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Если Объект.Обучающиеся.Количество() > 0 Тогда
		Объект.Обучающиеся.Очистить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура МесяцВыплатыПриИзменении(Элемент)
	ВыводМесяц(Истина);	
КонецПроцедуры
