Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДвижениеОбучающихся.Номер КАК НомерПриказа,
	|	ДвижениеОбучающихся.Дата КАК ДатаПриказа,
	|	ДвижениеОбучающихся.Обучающиеся.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		ФИО КАК ФИО,
	|		Класс КАК Класс
	|	) КАК Обучающиеся,
	|	ДвижениеОбучающихся.ДатаДействия КАК ДатаДействия,
	|	ДвижениеОбучающихся.УчебныйГод КАК УчебныйГод,
	|	ДвижениеОбучающихся.ТипДокумента КАК ТипДокумента,
	|	ДвижениеОбучающихся.Комментарий КАК Комментарий,
	|	ДвижениеОбучающихся.Ссылка КАК ДокументСсылка,
	|	ДвижениеОбучающихся.Литера КАК Литера
	|ИЗ
	|	Документ.ДвижениеОбучающихся КАК ДвижениеОбучающихся
	|ГДЕ
	|	ДвижениеОбучающихся.Ссылка В(&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	ЗапросКонстанта = Новый Запрос("Выбрать Константы.РуководительОрганизации Как Объект Из Константы");
	Руководитель = ЗапросКонстанта.Выполнить().Выбрать();
	Если Не Руководитель.Следующий() Тогда
		Сообщить("Ошибка: Не удалось получить данные о руководителе организации");
		Возврат;
    КонецЕсли;
	
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		Если Выборка.ТипДокумента = Перечисления.ТипыДвиженияОбучающегося.ПустаяСсылка() Тогда
			Сообщить("Пустой документ");
			Возврат;
		ИначеЕсли Выборка.ТипДокумента = Перечисления.ТипыДвиженияОбучающегося.ПриемНаОбучение Тогда
			ВыводПриказОЗачислении(Выборка,ТабДок,Руководитель.Объект);	
		ИначеЕсли Выборка.ТипДокумента = Перечисления.ТипыДвиженияОбучающегося.ПереходМеждуКлассами Тогда
			ВыводПриказОПереводе(Выборка,ТабДок,Руководитель.Объект);
		ИначеЕсли Выборка.ТипДокумента = Перечисления.ТипыДвиженияОбучающегося.Отчисление Тогда
			ВыводПриказОбОтчислении(Выборка,ТабДок,Руководитель.Объект);
		ИначеЕсли Выборка.ТипДокумента = Перечисления.ТипыДвиженияОбучающегося.ОкончаниеОбучения Тогда
			ВыводПриказОбОкончанииОбучения(Выборка,ТабДок,Руководитель.Объект);
		ИначеЕсли Выборка.ТипДокумента = Перечисления.ТипыДвиженияОбучающегося.НовыйУчебныйГод Тогда	
			ВыводПриказНовыйУчебныйГод(Выборка,ТабДок,Руководитель.Объект);	
		Иначе
			Сообщить("Макет не реализован");
			Возврат	
		КонецЕсли;

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры 





