
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
    Если ТипДокумента = Перечисления.ТипыДвиженияОбучающегося.ПустаяСсылка() Тогда 
		Сообщить("Тип документа - обязательное поле");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	Если ДатаДействия = '00010101' Тогда
			Сообщить("Дата действия не задана");
			Отказ = Истина;
			Возврат;
	КонецЕсли;

	
	
	
	Движения.ДвиженияОбучающихся.Записывать = Истина;
		
	Для Каждого ТекСтрокаОбучающиеся Из Обучающиеся Цикл   
		Если ТекСтрокаОбучающиеся.ФИО = Справочники.Обучающиеся.ПустаяСсылка() Тогда
			Сообщить("В строке " + ТекСтрокаОбучающиеся.НомерСтроки + " не заполнен обучающийся"); 
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		Движение = Движения.ДвиженияОбучающихся.Добавить();
		Движение.Период = ДатаДействия;
		Движение.Обучающийся = ТекСтрокаОбучающиеся.ФИО;
		Движение.ТипДвижения = ТипДокумента;
		
		Если ТипДокумента = Перечисления.ТипыДвиженияОбучающегося.Отчисление Тогда
			Движение.Класс = Справочники.Классы.ПустаяСсылка();
			Движение.УчебныйГод = Справочники.УчебныеГода.ПустаяСсылка();
			Движение.Комментарий = Комментарий;
			Движение.Отчислен = Истина;
			Движение.Условно = Ложь;
		ИначеЕсли ТипДокумента = Перечисления.ТипыДвиженияОбучающегося.ОкончаниеОбучения Тогда
			Движение.Класс = Справочники.Классы.ПустаяСсылка();
			Движение.УчебныйГод = Справочники.УчебныеГода.ПустаяСсылка();
			Движение.Комментарий = "";
			Движение.Отчислен = Истина;
			Движение.Условно = Ложь;
		Иначе   //Остались прием на обучение и переход между классами
			Если ТекСтрокаОбучающиеся.Класс = Справочники.Классы.ПустаяСсылка() Тогда
				Сообщить("У обучающегося " + ТекСтрокаОбучающиеся.ФИО + " не заполнен класс"); 
				Отказ = Истина;
				Возврат;				
			КонецЕсли;
			Движение.Класс = ТекСтрокаОбучающиеся.Класс;
			Движение.УчебныйГод = УчебныйГод;
			Движение.Комментарий = "";
			Движение.Отчислен = Ложь;
			Движение.Условно = Ложь;
		КонецЕсли;	

	
	КонецЦикла;
	
	
	
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры


Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Обучающиеся") Тогда
		СтрокаОбучающиеся = Обучающиеся.Добавить();
		СтрокаОбучающиеся.ФИО = ДанныеЗаполнения.Ссылка;
		СтрокаОбучающиеся.Отличник = Ложь;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры


Процедура ПриЗаписи(Отказ)
	// Вставить содержимое обработчика.
КонецПроцедуры

