Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Трудоустройство.Номер КАК Номер,
	|	Трудоустройство.Дата КАК Дата,
	|	Трудоустройство.Обучающийся КАК Обучающийся,
	|	Трудоустройство.Класс КАК Класс,
	|	Трудоустройство.НачалоПериода КАК НачалоПериода,
	|	Трудоустройство.КонецПериода КАК КонецПериода,
	|	Трудоустройство.КлассныйРуководитель КАК КлассныйРуководитель
	|ИЗ
	|	Документ.Трудоустройство КАК Трудоустройство
	|ГДЕ
	|	Трудоустройство.Ссылка В(&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	ЗапросКонстанта = Новый Запрос("Выбрать Константы.РуководительОрганизации Как Объект Из Константы");
	Руководитель = ЗапросКонстанта.Выполнить().Выбрать();
	Если Не Руководитель.Следующий() Тогда
		Сообщить("Ошибка: Не удалось получить данные о руководителе организации");
		Возврат;
    КонецЕсли;
	
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ВыводТрудоустройство(Выборка,ТабДок,Руководитель.Объект);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры 





