


&НаСервере
Функция ПолучитьАктуальныйПриказ(Ссылка)
	Отбор = Новый Структура("Обучающийся", Ссылка);
	Срез = РегистрыСведений.ДвиженияОбучающихся.СрезПоследних(Объект.Дата,Отбор);
	Если Срез.Количество() < 1 Тогда  // Если не найдено данных
		Отчислен = Ложь;
		
		Возврат Ложь;
	Иначе
		 АктуальныйПриказ = Срез[0].Регистратор;
		 Объект.Класс = Срез[0].Класс; 
		 Возврат Истина;
	КонецЕсли
КонецФункции

&НаКлиенте
Процедура ОбучающийсяПриИзменении(Элемент)
	Ответ = ПолучитьАктуальныйПриказ(Объект.Обучающийся);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Ответ = ПолучитьАктуальныйПриказ(Объект.Обучающийся);
КонецПроцедуры
