Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КомпенсацияПроезд.Ссылка КАК Ссылка,
	|	КомпенсацияПроезд.ВерсияДанных КАК ВерсияДанных,
	|	КомпенсацияПроезд.ПометкаУдаления КАК ПометкаУдаления,
	|	КомпенсацияПроезд.Номер КАК Номер,
	|	КомпенсацияПроезд.Дата КАК Дата,
	|	КомпенсацияПроезд.Проведен КАК Проведен,
	|	КомпенсацияПроезд.МесяцВыплаты КАК МесяцВыплаты,
	|	КомпенсацияПроезд.Обучающиеся.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		Родитель КАК Родитель,
	|		Родитель.ДатаРождения КАК РодительДатаРождения,
	|		Банк КАК Банк,
	|		РасчетныйСчет КАК РасчетныйСчет,
	|		Обучающийся КАК Обучающийся,
	|		Класс КАК Класс,
	|		УдостоверениеМногодетныхНомер КАК УдостоверениеМногодетныхНомер,
	|		СрокДействия КАК СрокДействия
	|	) КАК Обучающиеся
	|ИЗ
	|	Документ.КомпенсацияПроезд КАК КомпенсацияПроезд
	|ГДЕ
	|	КомпенсацияПроезд.Ссылка В(&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	КомпенсацияПроездОбучающиеся.Родитель КАК Родитель
	               |ИЗ
	               |	Документ.КомпенсацияПроезд.Обучающиеся КАК КомпенсацияПроездОбучающиеся
	               |ГДЕ
	               |	КомпенсацияПроездОбучающиеся.Ссылка В(&Ссылка)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	КомпенсацияПроездОбучающиеся.Родитель
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	КомпенсацияПроездОбучающиеся.Родитель.Наименование";
	Родители = Запрос.Выполнить().Выбрать();
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	
	ОбщееКолвоСтрок = 0;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПерваяСтрока = ОбщееКолвоСтрок + 4;
		КолвоСтрок = ВыводКомпенсацияПроезд(Выборка,ТабДок,Родители) + ОбщееКолвоСтрок;
		
		ОбъединениеНачало = ПерваяСтрока;
		Флаг = ПерваяСтрока+1 <= КолвоСтрок;
		Для Строка=ПерваяСтрока+1 По КолвоСтрок Цикл
			Если ТабДок.Область("R"+Строка+"C3").Текст="" Тогда
				Продолжить;
			Иначе  
				ТабДок.Область("R"+ОбъединениеНачало+"C1"+":"+"R"+Строка(Строка-1)+"C2").Объединить(); //Номер
				ТабДок.Область("R"+ОбъединениеНачало+"C3"+":"+"R"+Строка(Строка-1)+"C9").Объединить(); //Родитель
				ТабДок.Область("R"+ОбъединениеНачало+"C10"+":"+"R"+Строка(Строка-1)+"C13").Объединить(); //Банк
				ТабДок.Область("R"+ОбъединениеНачало+"C14"+":"+"R"+Строка(Строка-1)+"C19").Объединить(); //Расчетный счет
				ТабДок.Область("R"+ОбъединениеНачало+"C31"+":"+"R"+Строка(Строка-1)+"C32").Объединить(); //Номер удост.
				ТабДок.Область("R"+ОбъединениеНачало+"C33"+":"+"R"+Строка(Строка-1)+"C35").Объединить(); //Срок действия
				ОбъединениеНачало=Строка;
			КонецЕсли;
		КонецЦикла;
		
		Если Флаг Тогда //Объединить для последней строки 
			Строка = Строка - 1;
			ТабДок.Область("R"+ОбъединениеНачало+"C1"+":"+"R"+Строка(Строка-1)+"C2").Объединить(); //Номер
			ТабДок.Область("R"+ОбъединениеНачало+"C3"+":"+"R"+Строка(Строка-1)+"C9").Объединить(); //Родитель
			ТабДок.Область("R"+ОбъединениеНачало+"C10"+":"+"R"+Строка(Строка-1)+"C13").Объединить(); //Банк
			ТабДок.Область("R"+ОбъединениеНачало+"C14"+":"+"R"+Строка(Строка-1)+"C19").Объединить(); //Расчетный счет
			ТабДок.Область("R"+ОбъединениеНачало+"C31"+":"+"R"+Строка(Строка-1)+"C32").Объединить(); //Номер удост.
			ТабДок.Область("R"+ОбъединениеНачало+"C33"+":"+"R"+Строка(Строка-1)+"C35").Объединить(); //Срок действия	
		КонецЕсли;
			
		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;  
	
	
	//ОбъединениеНачало=2;
	//Для Строка=2 По ПоследняяСтрока Цикл
	//Если ТабДок.Область("R"+Строка+"C1").Текст=ТабДок.Область("R"+Строка(Строка-1)+"C1").Текст
	//	ИЛИ ОбъединениеНачало=Строка ТогдаПродолжить;
	//Иначе
	//ТабДок.Область("R"+ОбъединениеНачало+"C1"+":"+"R"+Строка(Строка-1)+"C1").Объединить();
	//ОбъединениеНачало=Строка;
	//КонецЕсли;
	//КонецЦикла;
	//}}        
	
	
КонецПроцедуры 
